IRP/src/Catalogs/BankTerms/BankTerms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>BankTerms</name>
 <attributes>
  <name>BankTermType</name>
  <type>
   <types>EnumRef.BankTermTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>PaymentTypes</name>
  <attributes>
   <name>PaymentType</name>
   <type>
    <types>CatalogRef.PaymentTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Percent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
  <attributes>
   <name>Account</name>
   <type>
    <types>CatalogRef.CashAccounts</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>PartnerTerms</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalNameContract</name>
   <type>
    <types>CatalogRef.LegalNameContracts</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/BranchBankTerms/BranchBankTerms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>BranchBankTerms</name>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BankTerm</name>
  <type>
   <types>CatalogRef.BankTerms</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/BankTerms/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	FilterIsSet = (TypeOf(Parameters) = Type("Structure") 
		And ValueIsFilled(Parameters.SearchString)
		And Parameters.Filter.Property("PaymentType")
		And Parameters.Filter.Property("Branch"));
		
	If Not FilterIsSet Then
		Return;
	EndIf;
	
	StandardProcessing = False;
	CommonFormActionsServer.CutLastSymbolsIfCameFromExcel(Parameters);
	CatalogsServer.SetParametersForDataChoicing(Catalogs.BankTerms, Parameters);
	
	Query = New Query;
	If ValueIsFilled(Parameters.Filter.PaymentType) And ValueIsFilled(Parameters.Filter.Branch) Then
		Query.Text = GetQueryText_Filter();
	Else
		Query.Text = GetQueryText_All();
	EndIf;

	Query.Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Query.Text);
	
	For Each Filter In Parameters.Filter Do
		Query.SetParameter(Filter.Key, Filter.Value);
	EndDo;
	Query.SetParameter("PaymentType", Parameters.Filter.PaymentType);
	Query.SetParameter("Branch", Parameters.Filter.Branch);
	Query.SetParameter("SearchString", Parameters.SearchString);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	ChoiceData = CommonFormActionsServer.QueryTableToChoiceData(QueryTable);
EndProcedure

Function GetQueryText_Filter()
	Return
		"SELECT
		|	2 AS Sort,
		|	Table.Ref AS Ref,
		|	Table.Description_en AS Presentation
		|FROM
		|	Catalog.BankTerms AS Table
		|		INNER JOIN Catalog.BankTerms.PaymentTypes AS TablePaymentTypes
		|		ON Table.Ref = TablePaymentTypes.Ref
		|		AND NOT Table.DeletionMark
		|		AND TablePaymentTypes.PaymentType = &PaymentType
		|		INNER JOIN InformationRegister.BranchBankTerms AS BranchBankTerms
		|		ON BranchBankTerms.BankTerm = Table.Ref
		|		AND BranchBankTerms.Branch = &Branch
		|		AND Table.Description_en LIKE ""%"" + &SearchString + ""%""
		|GROUP BY
		|	Table.Ref";
EndFunction

Function GetQueryText_All()
	Return 
		"SELECT
		|	2 AS Sort,
		|	Table.Ref,
		|	Table.Description_en AS Presentation
		|FROM
		|	Catalog.BankTerms AS Table
		|WHERE
		|	Table.Description_en LIKE ""%"" + &SearchString + ""%""
		|	AND NOT Table.DeletionMark";
EndFunction
